devdnl/dnx-rtos/src/system/drivers/sdspi/stm32f1/sdspi.c
                }

                ioctl(hdl->gpio_file, GPIO_IORQ_SD_DESELECT);
                spi_rw(0xFF);

                unlock_recursive_mutex(hdl->port_lock_mtx);
        }

        return n;


//
//
//        if (drv || !count) return RES_PARERR;
//        if (Stat & STA_NOINIT) return RES_NOTRDY;
//
//        if (!(CardType & CT_BLOCK)) sector *= 512;      /* Convert to byte address if needed */
//
//        if (count == 1) {       /* Single block read */
//                if (send_cmd(CMD17, sector) == 0)       { /* READ_SINGLE_BLOCK */
//                        if (rcvr_datablock(buff, 512)) {
//                                count = 0;
//                        }
//                }
//        }
//        else {                          /* Multiple block read */
//                if (send_cmd(CMD18, sector) == 0) {     /* READ_MULTIPLE_BLOCK */
//                        do {
//                                if (!rcvr_datablock(buff, 512)) {
//                                        break;
//                                }
//                                buff += 512;
//                        } while (--count);
//                        send_cmd(CMD12, 0);                             /* STOP_TRANSMISSION */
//                }
//        }
//        release_spi();
//
//        return count ? RES_ERROR : RES_OK;

        return 0;
}

//==============================================================================
/**SDSPI_SPI
 * @brief Direct IO control
 *
 * @param[in]     *drvhdl       driver's memory handle
 * @param[in]     iorq          IO request
 * @param[in,out] args          additional arguments
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
stdret_t SDSPI_ioctl(void *drvhdl, int iorq, va_list args)
{
        (void) args;

        struct sdspi_data *hdl = drvhdl;
        stdret_t status = STD_RET_OK;

        if (!hdl) {
                return STD_RET_ERROR;
        }
#include "core/io.h"
        if (lock_recursive_mutex(hdl->port_lock_mtx, MTX_BLOCK_TIME) == MUTEX_LOCKED) {
                switch (iorq) {
                case SDSPI_IORQ_INITIALIZE_CARD:
                        ioctl(hdl->gpio_file, GPIO_IORQ_SD_DESELECT);
                        for (int n = 0; n < 10; n++) {
                                spi_rw(0xFF);
                        }

                        int  timeout = 2 * SDSPI_WAIT_TIMEOUT;
                        u8_t cmd;
                        u8_t OCR[4];

                        hdl->card_type = 0;
                        hdl->card_initialized = false;

                        if (send_cmd(hdl, CMD0, 0) == 0x01) {
                                if (send_cmd(hdl, CMD8, 0x1AA) == 0x01) { /* check SDHC card */
                                        for (int n = 0; n < 4; n++) {
                                                OCR[n] = spi_rw(0xFF);
                                        }

                                        if (OCR[2] == 0x01 && OCR[3] == 0xAA) {
                                                while (--timeout && send_cmd(hdl, ACMD41, 1UL << 30)) {
                                                        sleep_ms(1);
                                                }

                                                if (timeout && send_cmd(hdl, CMD58, 0) == 0) {
                                                        for (int n = 0; n < 4; n++) {
                                                                OCR[n] = spi_rw(0xFF);
                                                        }

                                                        hdl->card_type = (OCR[0] & 0x40) ? CT_SD2 | CT_BLOCK : CT_SD2;
                                                }
                                        }
                                } else { /* SDSC or MMC */
                                        if (send_cmd(hdl, ACMD41, 0) <= 0x01)   {
                                                hdl->card_type = CT_SD1;
                                                cmd = ACMD41;   /* SDSC */
                                        } else {
                                                hdl->card_type = CT_MMC;
                                                cmd = CMD1;     /* MMC */
                                        }

                                        /* Wait for leaving idle state */
                                        while (timeout && send_cmd(hdl, cmd, 0)) {
                                                timeout--;
                                                sleep_ms(1);
                                        }

                                        /* set R/W block length to 512 */
                                        if (!timeout || send_cmd(hdl, CMD16, 512) != 0) {
                                                hdl->card_type = 0;
                                        }
                                }

                                if (timeout) {
                                        hdl->card_initialized = true;
                                }
                        }

                        ioctl(hdl->gpio_file, GPIO_IORQ_SD_DESELECT);
                        spi_rw(0xFF);

                        if (hdl->card_initialized == false) {
                                printk("Card not initialized...\n");
                        } else {
                                printk("Card initialized. Card type: 0x%x\n", hdl->card_type);
                        }

                        break;

                default:
                        status = STD_RET_ERROR;
                        break;
                }

                unlock_recursive_mutex(hdl->port_lock_mtx);
        } else {
                return STD_RET_ERROR;
        }

        return status;
}

//==============================================================================
/**
 * @brief Function flush device
 *
 * @param[in] *drvhdl           driver's memory handle
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
stdret_t SDSPI_flush(void *drvhdl)
{
        (void) drvhdl;

